{
    "projects": [
        {
            "id": 1,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2Fdrum-kit.png?alt=media&token=e7b8513d-6019-440a-b0de-51f727476d3d",
            "title": "Drum Kit",
            "URL": "https://fabscg.github.io/drum-kit/",
            "github": "https://github.com/Fabscg/drum-kit",
            "description": "This is just a simple page with some keys that can be used from your keyboard to create music..."
        },
        {
            "id": 2,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2FLanterna-restaurant.png?alt=media&token=a0914400-5d27-4396-84a6-05320a75517d",
            "title": "Lanterna|Restaurant and Marketplace",
            "URL": "https://lanterna-marketplace-ee30b.web.app",
            "github": "https://github.com/Fabscg/lanterna-marketplace",
            "description": "Proudly to say that this is my second website as a self employee, very simple but that was the request from the owners, no email, or social media information but their phone number just to order on line. it is about an Italian restaurant that offers pasta, pizzas, salads, wine, and also is a mini marketplace with italian produce. The site contains the most important things that are the Menu, Contact information and Location. I only used HTML, CSS, Bootstrap and JavaScript."
        },
        {
            "id": 3,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2Fartist-and-lyrics-project.png?alt=media&token=16770257-f4ca-4563-9ca4-305220c58edd",
            "title": "Artist & Lyrics",
            "URL": "https://chamibia.github.io/lyrics-finder/",
            "github": "https://github.com/Fabscg/lyrics-finder",
            "description": "This was the first project that I participated in with a team. The six team members divided the work to   make this amazing page that enables users to type a musician's name and then several songs from that artist appear. Once a song is selected, the lyrics appear. Alternatively, a user can type the song title and the lyrics will show up. This site is good for singers who want to reproduce music by other artists, or for music enthusiasts who want to learn their favourite songs. I was responsible for the front-end, so I used flexbox in order to make it functional and responsive, too. We used two different APIs (iTunes and lyrics.ovh), HTML, CSS and JavaScript."
        },
        {
            "id": 4,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2Frun-buddy.png?alt=media&token=4a1faf25-e166-4a98-bf89-341819847471",
            "image": "gs://web-portfolio-1bf32.appspot.com/images/run-buddy.png",
            "title": "Run Buddy",
            "URL": "https://fabscg.github.io/run-buddy/",
            "github": "https://github.com/Fabscg/run-buddy",
            "description": "Run buddy was a design from my bootcamp. This was one of the first projects that I worked on, and as such, I found it to be a big challenge at the time. It was created for a gym company, and provides information about their trainers and the location, while also allowing people to sign up for newsletters. Languages used here are HTML and CSS style."
        },
        {
            "id": 5,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2Fbike-haven.png?alt=media&token=0cd6f9b8-c96f-4330-a290-596569cbc98b",
            "title": "Bike Haven",
            "URL": "https://bike-haven.herokuapp.com/",
            "github": "https://github.com/Fabscg/Bike-Haven",
            "description": "Bike Haven was a group project. Six of us collaborated to develop a cycling/parts sales site.We used Node as the server, MySQL as the DB, Handlebars library for the templates, Bootstrap, bcript, express, Sequelize, dotenv dependencies, and Heroku for the deployment.My greatest personal challenge with this project was Handlebars, as I had never used it and wanted to use it for this project to challenge myself."
        },
        {
            "id": 6,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2Fmission-possible.png?alt=media&token=d88c1721-168b-4147-94ba-fe66da04afa3",
            "title": "Mission: Possible",
            "URL": "https://glacial-cliffs-90348.herokuapp.com/",
            "github": "https://github.com/Fabscg/group-3-project",
            "description": "In this app made with my team mates, we are tryin to enocurage people to help others in need. Being benefactors we anted to make this app that connect to 3 different charities, so people can have an option to donate to any of their choice.  I worked in this project with GraphQL and Front-end, but this project has different dependencies like."
    
        },
        {
            "id": 7,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2Ftech-blog-site.png?alt=media&token=04da1b7f-1892-414b-b7d3-7b2434299a0b",
            "title": "Tech Blog",
            "URL": "https://afternoon-crag-71461.herokuapp.com/login",
            "github": "https://github.com/Fabscg/MVC-challenge-ITblog",
            "description": "Tech Blog was another bootcamp assignment, that I made using my own style. This is a blog that can be used by anyone, not just IT people. Users can post any information, news, or anything about the IT world. A personal challenge for me was using Handlebars. I find it a little bit complicated having to use Handlebars with MySQL, but I managed to make it work. Dependencies installed are express-sessions, express-handlebars, MySQL, Sequelize, dotenv and connect-session-sequelize for the DB."
        },
        {
            "id": 8,
            "imageUrl": "https://firebasestorage.googleapis.com/v0/b/web-portfolio-1bf32.appspot.com/o/images%2FpassGenerator.png?alt=media&token=6ccd71bc-5252-4789-a0f4-af420faa2f5f",
            "title": "Password Generator",
            "URL": "https://fabscg.github.io/passgenerator/",
            "github": "https://github.com/Fabscg/passgenerator",
            "description": "This project is for individuals who like to use difficult password, however have a hard time coming up with them. It can be used to generate a password for any social media account. The languages used for this project are HTML, CSS and JavaScript."
        }
    ]
} 

